Конфигурация/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияИМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ОтгрузкаКлиенту/ОтгрузкаКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтгрузкаКлиенту</name>
  <registerRecords>AccumulationRegister.ОстаткиПродукции</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияИМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/Заказ/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

    Подтвержден = Ложь;

    СуммаЗаказа = 0;
    Для Каждого СтрокаТЧ Из Продукция Цикл
        СуммаЗаказа = СуммаЗаказа + СтрокаТЧ.Сумма;
    КонецЦикла;

    МинимальнаяСумма = 500;

    Если СуммаЗаказа > МинимальнаяСумма Тогда
        Подтвержден = Истина;
    Иначе
        Подтвержден = Ложь;
    КонецЕсли;

    ЭтотОбъект.Подтвержден = Подтвержден;

КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    // Проверяем, подтвержден ли заказ
    Если Не ЭтотОбъект.Подтвержден Тогда
        Возврат;
    КонецЕсли;

    // Создаем документ ОтгрузкаКлиенту
    Попытка

        НоваяОтгрузка = Документы.ОтгрузкаКлиенту.СоздатьДокумент();

        // Заполняем реквизиты шапки
        НоваяОтгрузка.Клиент = ЭтотОбъект.Клиент;
        НоваяОтгрузка.Дата = ТекущаяДата();
        НоваяОтгрузка.ЗаказОснование = Ссылка;

        // Копируем табличную часть
        Для Каждого СтрокаЗаказа Из Продукция Цикл
            НоваяСтрока = НоваяОтгрузка.Продукция.Добавить();
            НоваяСтрока.Продукция  = СтрокаЗаказа.Продукция;
            НоваяСтрока.Количество = СтрокаЗаказа.Количество;
            НоваяСтрока.Цена       = СтрокаЗаказа.Цена;
            НоваяСтрока.Сумма      = СтрокаЗаказа.Сумма;
        КонецЦикла;

        // Сначала записываем, затем проводим
        НоваяОтгрузка.Записать();

        Попытка
            НоваяОтгрузка.Провести(); // создаст движения по ОстаткиПродукции
        Исключение
            Сообщить("Внимание! Автоматическая отгрузка не была проведена: " + ОписаниеОшибки(), СтатусСообщения.Важное);
            // Если нужно отменять проведение заказа при неуспешной отгрузке, раскомментируйте:
            // Отказ = Истина;
        КонецПопытки;

    Исключение
        Сообщить("Внимание! Автоматическая отгрузка не была создана: " + ОписаниеОшибки(), СтатусСообщения.Важное);
        // Если нужно отменять проведение заказа при ошибке создания, раскомментируйте:
        // Отказ = Истина;
    КонецПопытки;

КонецПроцедуры
